In [13]:
import pandas as pd
df_in = pd.DataFrame( {
    "citi":["Pune","Mumbai","Sangli"],
    "tmp":[15,20,18],
    "wind":[23,12,7]})

df

           citi  tmp  wind
Ind 0      Pune   15    23
    1    Mumbai   20    12
    2    Sangli   18     7
US  0  new york   12     8
    1    canada   10     7
    2    maxico   11     7

In [3]:
df_f = pd.DataFrame( {
    "citi":["new york","canada","maxico"],
    "tmp":[12,10,11],
    "wind":[8,7,7],})

In [8]:
df = pd.concat([df_in,df_f],keys=["Ind","US"])

In [10]:
df.loc["US"]

       citi  tmp  wind
0  new york   12     8
1    canada   10     7
2    maxico   11     7

In [11]:
df.loc["Ind"]

     citi  tmp  wind
0    Pune   15    23
1  Mumbai   20    12
2  Sangli   18     7

In [12]:
df1 = pd.concat([df_in,df_f], ignore_index=True)
df1

       citi  tmp  wind
0      Pune   15    23
1    Mumbai   20    12
2    Sangli   18     7
3  new york   12     8
4    canada   10     7
5    maxico   11     7

In [19]:
df_hu = pd.DataFrame( {
    "citi":["Mumbai","Pune","Sangli"],
    "humidity":[4,20,17]
    })

In [20]:
df_hu.set_index("citi")

        humidity
citi
Mumbai         4
Pune          20
Sangli        17

In [21]:
df_in.set_index("citi")

        tmp  wind
citi
Pune     15    23
Mumbai   20    12
Sangli   18     7

In [22]:
pd.concat([df_in,df_hu], axis=1)

     citi  tmp  wind    citi  humidity
0    Pune   15    23  Mumbai         4
1  Mumbai   20    12    Pune        20
2  Sangli   18     7  Sangli        17

In [23]:
pd.merge(df_in,df_hu,on="citi" ,how="outer")

     citi  tmp  wind  humidity
0  Mumbai   20    12         4
1    Pune   15    23        20
2  Sangli   18     7        17